{
    "task1_subjects": {
        "academic": [
            "A bar chart comparing the percentage of households with internet access in five countries between 2010 and 2020.",
            "A line graph showing the average monthly temperature in London over a year.",
            "A pie chart illustrating the main sources of energy production in Germany in 2022.",
            "A table detailing the population growth rate of major cities from 1990 to 2020.",
            "A process diagram explaining how coffee is produced from bean to cup.",
            "Two maps showing the layout of a university campus in 1995 and present day.",
            "A bar chart showing the number of visitors to a museum per month over a year.",
            "A line graph tracking the stock price of a tech company over five years.",
            "A pie chart representing the distribution of a country's workforce across different sectors.",
            "A table comparing the nutritional information of different breakfast cereals.",
            "A process diagram illustrating the life cycle of a butterfly.",
            "Maps depicting the change in forest cover in a region over 50 years.",
            "A bar chart comparing the literacy rates in different age groups in a specific country.",
            "A line graph showing the fluctuation in unemployment rates from 2000 to 2020.",
            "Pie charts comparing the market share of smartphone brands in 2015 and 2025.",
            "A table listing the top 10 countries by GDP in the last decade.",
            "A process diagram explaining the water cycle.",
            "Maps showing the proposed development plan for a new shopping center.",
            "A bar chart illustrating the amount of rainfall in three different cities over six months.",
            "A line graph tracking the number of international students enrolled in UK universities.",
            "A pie chart showing the preferred modes of transport for commuters in a large city.",
            "A table comparing the features and prices of different car models.",
            "A process diagram showing how glass bottles are recycled.",
            "Maps illustrating the changes in a coastal town due to erosion.",
            "A bar chart comparing the average salaries for various professions.",
            "A line graph showing the trend in global carbon emissions since 1990.",
            "Pie charts showing the different types of energy consumed in a household.",
            "A table detailing the schedule for an international conference.",
            "A process diagram explaining the process of photosynthesis.",
            "Maps showing the expansion of a city's subway system over time.",
            "A bar chart comparing the sales figures of two competing companies over four quarters.",
            "A line graph showing the population growth of India and China.",
            "A pie chart representing the age distribution of a country's population.",
            "A table comparing the climate data (temperature, rainfall) of two cities.",
            "A process diagram showing how a bill becomes law.",
            "Maps illustrating the changes in land use in a rural area.",
            "A bar chart comparing the number of books borrowed from a library by genre.",
            "A line graph showing the changes in house prices in a specific region.",
            "A pie chart showing the results of a survey on favorite holiday destinations.",
            "A table listing the ingredients and steps for a recipe.",
            "A process diagram explaining the production of chocolate.",
            "Maps showing the predicted changes to a coastline due to rising sea levels.",
            "A bar chart comparing the performance of students in different subjects.",
            "A line graph tracking the consumption of renewable energy sources.",
            "Pie charts comparing the proportion of students choosing arts vs science subjects.",
            "A table showing the winners of the Nobel Prize in Physics for the last 10 years.",
            "A process diagram illustrating the workings of a car engine.",
            "Maps showing the distribution of different species in a national park.",
            "A bar chart showing the sources of government revenue.",
            "A line graph illustrating the trend of online shopping.",
            "A pie chart representing the types of waste generated by a city.",
            "A table comparing the opening hours and facilities of different gyms.",
            "A process diagram explaining how electricity is generated in a coal power plant.",
            "Maps showing the historical changes in the boundaries of a country.",
            "A bar chart comparing the amount of time people spend on different media platforms.",
            "A line graph tracking the number of patents filed annually.",
            "Pie charts showing the allocation of a student's monthly budget.",
            "A table listing the participants and results of a sports tournament.",
            "A process diagram illustrating the stages of human development.",
            "Maps showing the migration routes of birds.",
            "A bar chart comparing tourist arrivals in different countries.",
            "A line graph showing the trend in global average temperatures.",
            "A pie chart representing the causes of deforestation.",
            "A table comparing the effectiveness of different types of insulation.",
            "A process diagram explaining the operation of a desalination plant.",
            "Maps showing the location of historical landmarks in a city.",
            "A bar chart comparing the box office revenue of different film genres.",
            "A line graph tracking the adoption rate of electric vehicles.",
            "Pie charts showing the composition of exports for a country.",
            "A table listing the emergency contact numbers for various services.",
            "A process diagram illustrating the process of making paper.",
            "Maps showing the changes in agricultural land use over time.",
            "A bar chart comparing the cost of living in different major cities.",
            "A line graph showing the infant mortality rate trend over 50 years.",
            "A pie chart representing the different languages spoken in a multilingual country.",
            "A table comparing the specifications of different laptop models.",
            "A process diagram explaining how earthquakes occur.",
            "Maps showing the planned route for a new high-speed railway.",
            "A bar chart illustrating the frequency of different types of weather events.",
            "A line graph tracking the number of social media users worldwide.",
            "A pie chart showing the main contributors to air pollution in a city.",
            "A table listing the public holidays in a country for the upcoming year.",
            "A process diagram illustrating the filtration of water.",
            "Maps showing the before and after of a natural disaster site.",
            "A bar chart comparing the energy efficiency ratings of home appliances.",
            "A line graph showing the trend in international trade volume.",
            "Pie charts comparing the dietary habits of people in two different regions.",
            "A table showing the conversion rates between different currencies.",
            "A process diagram explaining the function of the human respiratory system.",
            "Maps illustrating the layout of a proposed housing development.",
            "A bar chart showing the distribution of grades in a university course.",
            "A line graph tracking the number of endangered species over time.",
            "A pie chart representing the funding sources for a research project.",
            "A table comparing the travel times and costs for different modes of transport.",
            "A process diagram showing how aluminum cans are manufactured."
        ],
        "general": [
            "Write an informal letter to a friend inviting them to your birthday party.",
            "Write a semi-formal letter to your neighbours apologising for noise during a recent renovation.",
            "Write a formal letter to a bank requesting information about opening a new account.",
            "Write an informal letter thanking a relative for a gift they sent you.",
            "Write a semi-formal letter to a local council suggesting improvements to a park.",
            "Write a formal letter to an airline complaining about a delayed flight.",
            "Write an informal letter to a friend describing a place you recently visited.",
            "Write a semi-formal letter to your landlord requesting a repair in your apartment.",
            "Write a formal letter to a company applying for a part-time job advertised online.",
            "Write an informal letter congratulating a friend on their recent success.",
            "Write a semi-formal letter to a college administrator inquiring about a course.",
            "Write a formal letter to a newspaper editor expressing your opinion on a local issue.",
            "Write an informal letter asking a friend for advice about a personal problem.",
            "Write a semi-formal letter to a manager explaining why you were absent from work.",
            "Write a formal letter to a hotel complaining about the service during your stay.",
            "Write an informal letter sharing some good news with your family.",
            "Write a semi-formal letter to a club secretary asking to join the club.",
            "Write a formal letter to your local library suggesting they purchase specific books.",
            "Write an informal letter apologising to a friend for missing their call.",
            "Write a semi-formal letter to a professor requesting an extension for an assignment.",
            "Write a formal letter to a government department requesting information under the Freedom of Information Act.",
            "Write an informal letter recommending a book or film to a friend.",
            "Write a semi-formal letter to a previous employer asking for a reference.",
            "Write a formal letter to a mobile phone company disputing a charge on your bill.",
            "Write an informal letter inviting a friend to stay with you for a weekend.",
            "Write a semi-formal letter to a neighbour asking them to keep their dog quiet.",
            "Write a formal letter resigning from your current job.",
            "Write an informal letter updating a friend on your life since you last met.",
            "Write a semi-formal letter to a school principal regarding your child's progress.",
            "Write a formal letter to a department store requesting a refund for a faulty item.",
            "Write an informal letter asking a friend to look after your pet while you are away.",
            "Write a semi-formal letter to a committee offering to volunteer your time.",
            "Write a formal letter to an insurance company making a claim.",
            "Write an informal letter checking if a friend received something you sent.",
            "Write a semi-formal letter requesting permission to hold an event in a public space.",
            "Write a formal letter to a university requesting a prospectus.",
            "Write an informal letter suggesting a meet-up with an old friend.",
            "Write a semi-formal letter explaining damage to borrowed equipment.",
            "Write a formal letter thanking a company for an interview.",
            "Write an informal letter expressing sympathy to a friend who is unwell.",
            "Write a semi-formal letter providing feedback on a service you received.",
            "Write a formal letter complaining about noisy construction work near your home.",
            "Write an informal letter asking for directions to a friend's new house.",
            "Write a semi-formal letter confirming arrangements for a meeting.",
            "Write a formal letter requesting leave of absence from work.",
            "Write an informal letter describing a funny incident that happened to you.",
            "Write a semi-formal letter to a local restaurant making a group booking.",
            "Write a formal letter inquiring about the availability of a product.",
            "Write an informal letter encouraging a friend who is facing a challenge.",
            "Write a semi-formal letter apologising for damaging a neighbour's property accidentally.",
            "Write a formal letter applying for a scholarship.",
            "Write an informal letter asking a friend to return something you lent them.",
            "Write a semi-formal letter requesting clarification on a bill or invoice.",
            "Write a formal letter suggesting improvements to your workplace environment.",
            "Write an informal letter sharing your travel plans with a friend.",
            "Write a semi-formal letter thanking someone for their help or support.",
            "Write a formal letter complaining about poor public transport services.",
            "Write an informal letter asking a friend about their new job.",
            "Write a semi-formal letter inviting a guest speaker to an event.",
            "Write a formal letter requesting cancellation of a subscription or membership.",
            "Write an informal letter wishing a friend good luck for an exam.",
            "Write a semi-formal letter reporting a lost item on public transport.",
            "Write a formal letter expressing dissatisfaction with a course you attended.",
            "Write an informal letter reminiscing about shared memories with a friend.",
            "Write a semi-formal letter asking for information about local recycling services.",
            "Write a formal letter applying for membership in a professional organization.",
            "Write an informal letter giving a friend recommendations for their visit to your city.",
            "Write a semi-formal letter seeking advice from a former teacher or mentor.",
            "Write a formal letter providing references for a job applicant.",
            "Write an informal letter asking a friend to join you for a hobby or activity.",
            "Write a semi-formal letter responding to an invitation you cannot accept.",
            "Write a formal letter appealing a decision made by an organization.",
            "Write an informal letter describing your new home to a family member.",
            "Write a semi-formal letter requesting a change to an appointment.",
            "Write a formal letter expressing concern about a proposed local development.",
            "Write an informal letter telling a friend about a concert or event you attended.",
            "Write a semi-formal letter complaining about a faulty product purchased online.",
            "Write a formal letter requesting sponsorship for a charity event.",
            "Write an informal letter asking a friend for help with moving house.",
            "Write a semi-formal letter inquiring about volunteer opportunities.",
            "Write a formal letter to a landlord giving notice to vacate the property.",
            "Write an informal letter planning a surprise party for a mutual friend.",
            "Write a semi-formal letter thanking a neighbour for their kindness.",
            "Write a formal letter accepting a job offer.",
            "Write an informal letter asking a friend if they want to share accommodation.",
            "Write a semi-formal letter responding to a complaint.",
            "Write a formal letter inquiring about lost property at an airport.",
            "Write an informal letter offering help to a friend in need.",
            "Write a semi-formal letter suggesting changes to a community project.",
            "Write a formal letter requesting a refund for cancelled travel plans.",
            "Write an informal letter telling a friend about your future plans.",
            "Write a semi-formal letter reporting an issue with a public facility.",
            "Write a formal letter complaining about misleading advertising.",
            "Write an informal letter seeking forgiveness after an argument.",
            "Write a semi-formal letter requesting feedback on a proposal or application.",
            "Write a formal letter outlining a business proposal."
        ]
    },
    "task2_subjects": [
        "Some people believe that universities should only offer subjects that will lead to good job prospects. Others think universities should offer a wide range of subjects regardless of future employment. Discuss both views and give your own opinion.",
        "Increasingly, people are choosing to eat processed food rather than home-cooked meals. What are the reasons for this trend? What are the effects on individuals and society?",
        "Governments should invest more money in public transport than in building new roads. To what extent do you agree or disagree?",
        "The development of artificial intelligence will have more negative than positive effects in the future. Do you agree or disagree?",
        "Many older buildings are protected by law because they are part of a nation's history. However, some people think they should be knocked down to make way for new ones. Discuss both views and give your opinion.",
        "Some people think that success in life comes from taking risks or chances. Others believe that success results from careful planning. Discuss both views and give your own opinion.",
        "In many countries, the amount of crime is increasing. What are the main causes of crime, and what measures can be taken to reduce it?",
        "Nowadays, many people prefer to communicate online rather than face-to-face. Is this a positive or negative development?",
        "Some argue that zoos are cruel and should be closed down. Others believe that zoos play an important role in conservation and education. Discuss both sides and give your opinion.",
        "International travel has become cheaper, and more countries are opening their doors to tourists. Are the advantages of increased tourism greater than the disadvantages?",
        "The gap between the rich and the poor is widening in many societies. What problems does this cause, and what solutions can be suggested?",
        "Advertising aimed at children should be banned. To what extent do you agree or disagree?",
        "Some believe that space exploration is a waste of money and resources that could be better spent on Earth. Others argue it is essential for the future of humanity. Discuss both views and provide your opinion.",
        "Modern lifestyles mean that many parents have little time for their children. What are the effects of this on children and society?",
        "Some people think that governments should provide free healthcare for all citizens. Others believe individuals should be responsible for their own healthcare costs. Discuss both views and give your opinion.",
        "Extreme sports like skydiving and rock climbing have become popular. Are the benefits of participating in such activities worth the risks involved?",
        "In many workplaces, online communication is now more common than face-to-face meetings. What are the advantages and disadvantages of this trend?",
        "Climate change is one of the biggest threats facing the planet. What can individuals do to combat climate change, and how effective are these actions?",
        "Some people believe that competitive sports are essential for children's development, while others think they put too much pressure on children. Discuss both views and give your opinion.",
        "The use of surveillance cameras in public places is increasing. Does this improve safety, or is it an invasion of privacy?",
        "Many people believe that traditional music and arts are losing their importance in modern society. Why might this be happening? Should efforts be made to preserve them?",
        "As robots become more advanced, they are taking over more human jobs. Is this a positive or negative development for society?",
        "Some think that the best way to learn about a foreign culture is to learn the language. Others believe there are better ways. Discuss both views and give your opinion.",
        "Obesity is a growing problem in many countries. What are the causes of obesity, and what measures should governments take to tackle it?",
        "Many people believe that capital punishment (the death penalty) is necessary to deter crime. Others argue it is inhumane. Discuss both sides and give your opinion.",
        "The internet allows people access to vast amounts of information, but it is difficult to know which information is reliable. What problems does this cause? What solutions can you suggest?",
        "Some argue that young people should be encouraged to travel and work abroad for a year before starting university or a career. What are the advantages and disadvantages of this?",
        "In many countries, people are living longer than ever before. What are the benefits and drawbacks of an aging population?",
        "Consumerism and the pressure to buy new products are increasing. What are the causes of this? Is this trend positive or negative?",
        "Some people think that students should be taught practical skills like cooking, sewing, and car maintenance at school. Others believe the focus should be solely on academic subjects. Discuss both views.",
        "Protecting endangered animal species is crucial. What are the main reasons why animals become endangered? What solutions can you suggest?",
        "With the rise of online streaming services, traditional cinemas are becoming less popular. Will cinemas survive in the future? Should they be preserved?",
        "Governments worldwide spend large sums of money on developing weapons. Some argue this is necessary for national security, while others believe the money should be spent on health and education. Discuss.",
        "Many historical artifacts are displayed in museums far from their country of origin. Should these artifacts be returned to their home countries?",
        "In some countries, young people are encouraged to live with their parents even after starting work, while in others, they are expected to leave home early. Discuss the advantages and disadvantages of each approach.",
        "The use of mobile phones should be banned in public places like restaurants and public transport. To what extent do you agree or disagree?",
        "Some people believe that genetically modified (GM) foods can help solve world hunger. Others worry about their potential health and environmental risks. Discuss both views and give your opinion.",
        "Happiness is considered very important in life. Why is it difficult to define? What factors are important in achieving happiness?",
        "Should governments censor the internet to protect citizens, or does this violate freedom of speech?",
        "More and more people are choosing to work from home. What are the benefits and drawbacks of remote working for employees and employers?",
        "Some people believe that hosting major international sporting events like the Olympics brings great benefits to the host city and country. Others argue the costs outweigh the benefits. Discuss.",
        "Plastic waste is a major environmental problem. What are the main sources of plastic waste? What measures can be taken by governments and individuals to reduce it?",
        "Some people argue that students benefit more from learning in groups, while others think they learn better studying alone. Discuss both approaches to learning.",
        "Is it more important for a country to invest in its infrastructure (roads, railways, etc.) or in its social services (healthcare, education)?",
        "The rise of social media has changed the way people interact and form relationships. Is this change positive or negative overall?",
        "Should dangerous wild animals be kept in captivity, or should they only live in their natural habitats?",
        "Some argue that formal examinations are the best way to assess a student's ability. Others believe continuous assessment is fairer. Discuss both methods.",
        "Migration brings both opportunities and challenges to countries. Discuss the effects of migration on the host country.",
        "Many people strive to achieve a balance between their work life and personal life. Why is this balance difficult to achieve? What can individuals and employers do?",
        "Do you think the advantages of online shopping outweigh the disadvantages?",
        "Some people believe that it is the responsibility of individuals to maintain a healthy lifestyle. Others argue that governments should play a bigger role in promoting public health. Discuss.",
        "Traditional skills and ways of life are disappearing in many parts of the world. Is it important to preserve these traditions? Why or why not?",
        "Is it better for children to grow up in the city or in the countryside? Discuss the advantages and disadvantages of each environment.",
        "News media plays a crucial role in modern society. How much influence does the media have on people's opinions and decisions?",
        "Some people think that unpaid community service should be a compulsory part of high school education. To what extent do you agree or disagree?",
        "Globalisation means that people around the world are increasingly consuming the same food, music, and fashion. Are the benefits of this cultural homogenisation greater than the drawbacks?",
        "Should parents be held legally responsible for the actions of their children?",
        "The development of tourism often damages the environment and local culture. What can be done to ensure tourism is sustainable?",
        "Some believe that famous people like actors and athletes have a responsibility to be positive role models for young people. Others disagree. Discuss both views.",
        "In the future, it is predicted that cars will be driverless. What are the potential advantages and disadvantages of this technology?",
        "Many people believe that success is measured by wealth and material possessions. Do you agree or disagree? What other factors define success?",
        "Should subjects like art, music, and drama be compulsory in schools?",
        "Reducing global poverty is a major challenge. What are the most effective ways to help poorer countries develop?",
        "The pressure on students to succeed academically is intense in many countries. What are the causes of this pressure? Is it a positive or negative trend?",
        "Do the benefits of air travel outweigh the environmental costs?",
        "Some people believe that censorship is necessary to protect society. Others argue it limits freedom and progress. Discuss both views.",
        "Is it more important for children to learn about local history or world history?",
        "Nowadays, people rely heavily on technology for everyday tasks. What are the risks associated with this dependence?",
        "Some argue that governments should subsidise artists and musicians to support culture. Others believe they should fund themselves. Discuss.",
        "Is it ethical to keep animals for entertainment purposes, such as in circuses or marine parks?",
        "In many cities, traffic congestion is a major problem. What are the causes of traffic jams? What solutions can be implemented?",
        "Should individuals be allowed to own guns?",
        "Some people think that modern architecture is ugly and does not fit well with older buildings. Others believe it reflects progress. Discuss.",
        "Is homework beneficial for students, or does it cause unnecessary stress?",
        "What are the main challenges facing education systems in the 21st century?",
        "How can international cooperation help solve global problems like pandemics or climate change?",
        "Should companies prioritise profit-making or social responsibility?",
        "Some people believe that the government should control the amount of violence shown on television and in films. To what extent do you agree?",
        "Is it important for people to maintain strong family ties in modern society?",
        "How has the internet changed the way people access and consume music?",
        "Should rich countries be required to help poorer countries more?",
        "What are the advantages and disadvantages of living in a multicultural society?",
        "Some people think that studying philosophy and history is a waste of time in the modern world. Others believe these subjects are essential. Discuss.",
        "Is it better to save money for the future or spend it enjoying life now?",
        "How can schools better prepare students for the challenges of the modern workforce?",
        "Should alternative medicine (like acupuncture or homeopathy) be integrated into national healthcare systems?",
        "What are the effects of advertising on society?",
        "Is it more effective to rehabilitate criminals or to punish them harshly?",
        "How can governments encourage people to adopt more environmentally friendly lifestyles?",
        "Some people argue that technology makes people more isolated. Others believe it connects people better. Discuss both viewpoints.",
        "Should students be allowed to use mobile phones and tablets in classrooms?",
        "What is the role of museums and art galleries in society today?",
        "Is job satisfaction more important than a high salary?",
        "How can the problem of homelessness be addressed effectively?",
        "Should animal testing be banned for all products, including medicines?",
        "What are the most important qualities of a good leader?",
        "Discuss the impact of fast fashion on the environment and society.",
        "Is it important for children to learn to play a musical instrument?",
        "How can individuals protect their privacy online?",
        "Should governments invest more in renewable energy sources like solar and wind power, even if they are currently more expensive?",
        "What are the challenges and benefits of working in a team?",
        "Is it possible to achieve world peace? What are the main obstacles?"
    ],
    "reading_subjects": {
        "academic": [
            "Sustainable Urban Planning - Renewable Energy Integration - Future City Design",
            "The Evolution of Human Communication - Digital Media Impact - Language Transformation",
            "Marine Biodiversity - Ocean Conservation - Coral Reef Ecosystems",
            "Space Exploration History - Current Missions - Future Possibilities",
            "Climate Change Science - Global Impacts - Mitigation Strategies",
            "Human Cognitive Development - Memory Formation - Learning Processes",
            "Agricultural Innovation - Food Security - Sustainable Farming",
            "Artificial Intelligence Development - Machine Learning - Ethical Considerations",
            "Ancient Civilizations - Archaeological Discoveries - Historical Analysis",
            "Healthcare Systems - Public Health - Disease Prevention"
        ],
        "general": [
            "Job Application Guide - Interview Tips - Workplace Etiquette",
            "Travel Planning - Accommodation Options - Local Transportation",
            "Healthy Lifestyle Choices - Nutrition Basics - Exercise Recommendations",
            "Home Maintenance - DIY Repairs - Renovation Planning",
            "Financial Management - Budgeting Tips - Saving Strategies",
            "Community Services - Local Facilities - Volunteer Opportunities",
            "Technology For Beginners - Device Setup - Online Safety",
            "Family Activities - Holiday Planning - Educational Outings",
            "Environmental Awareness - Recycling Guidelines - Energy Conservation",
            "Consumer Rights - Product Returns - Service Complaints"
        ]
    },
    "listening_subjects": [
        "University Campus Tour and Orientation",
        "Housing Accommodation Information Service",
        "Community Library Services and Programs",
        "Public Transportation System Guide",
        "Museum Guided Tour Information",
        "Student Club and Society Registration",
        "Job Interview Preparation Seminar",
        "Environmental Conservation Lecture",
        "Health and Nutrition Workshop",
        "Technology Innovation Conference"
    ]
}
